<?php

/*
Model-View-Controller (MVC, «Модель-Представление-Контроллер», «Модель-Вид-Контроллер») — схема разделения данных приложения и управляющей логики на три отдельных компонента: модель, представление и контроллер — таким образом, что модификация каждого компонента может осуществляться независимо[1].

Модель (Model) предоставляет данные и реагирует на команды контроллера, изменяя своё состояние[1].
Представление (View) отвечает за отображение данных модели пользователю, реагируя на изменения модели[1].
Контроллер (Controller) интерпретирует действия пользователя, оповещая модель о необходимости изменений[1].