


Суперглобальные переменные — Встроенные переменные, которые всегда доступны во всех областях
$GLOBALS — Ссылки на все переменные глобальной области видимости
$_SERVER — Информация о сервере и среде исполнения
$_GET — Переменные HTTP GET
$_POST — Переменные HTTP POST
$_FILES — Переменные файлов, загруженных по HTTP
$_REQUEST — Переменные HTTP-запроса
$_SESSION — Переменные сессии
$_ENV — Переменные окружения
$_COOKIE — HTTP Cookies
$php_errormsg — Предыдущее сообщение об ошибке
$http_response_header — Заголовки ответов HTTP
$argc — Количество аргументов, переданных скрипту
$argv — Массив переданных скрипту аргументов


file:// — Доступ к локальной файловой системе
http:// — Доступ к URL-адресам по протоколу HTTP(s)
ftp:// — Доступ к URL-адресам по протоколу FTP(s)
php:// — Доступ к различным потокам ввода-вывода parse_str(file_get_contents('php://input'), $_PUT);
zlib:// — Сжатые потоки
data:// — Схема Data (RFC 2397)
glob:// — Нахождение путей, соответствующих шаблону
phar:// — PHP-архив
ssh2:// — Secure Shell 2
rar:// — RAR
ogg:// — Аудиопотоки
expect:// — Потоки для взаимодействия с процессами


